### Imports

In [1]:
from sqlalchemy import create_engine
import psycopg2
import pandas as pd

### Config

In [4]:
PG_HOST="localhost"
PG_DATABASE="mr_alitas"
PG_USER="postgres"
PG_PASS="000111"

try:
  alchemyEngine = create_engine('postgresql+psycopg2://'+PG_USER+':'+PG_PASS+'@'+PG_HOST+':5432/'+PG_DATABASE+'', pool_recycle=3600)
except Exception as e:
  print("Error al iniciar postgresql: " + str(e))

### Funciones

In [3]:
def pg_connect():
  connection = psycopg2.connect(
    host=PG_HOST,
    database=PG_DATABASE,
    user=PG_USER,
    password=PG_PASS
  )
  return connection

### DATA ANALYSIS BY USER

In [5]:
with alchemyEngine.connect() as dbConnection:
  VENTAS = pd.read_sql(
    "SELECT * FROM ventas where id_usuario_fk = %s",
    dbConnection,
    params=(1,)
  )

In [6]:
VENTAS

,id_venta,num_productos,total,valor_pagado,cambio,fecha_creacion,id_usuario_fk
0,1,3,6.0,10.0,4.0,2023-12-22 23:40:29.807236,1
1,2,3,6.0,10.0,4.0,2023-12-22 23:50:33.534514,1
2,3,3,6.0,10.0,4.0,2023-12-22 23:51:42.694241,1
3,4,1,7.5,10.0,2.5,2023-12-22 23:52:49.640618,1
4,5,2,4.0,5.0,1.0,2023-12-22 23:54:17.137453,1
5,6,1,2.0,5.0,3.0,2023-12-22 23:55:10.123227,1
6,7,1,2.0,5.0,3.0,2023-12-22 23:58:41.016204,1
7,8,2,4.0,5.0,1.0,2023-12-22 23:59:32.086504,1
8,9,1,2.0,2.0,0.0,2023-12-23 00:00:47.269447,1
9,10,1,2.0,2.0,0.0,2023-12-23 00:01:59.489409,1
10,11,1,2.0,2.0,0.0,2023-12-23 00:02:16.360055,1
11,12,4,8.0,10.0,2.0,2023-12-23 00:03:51.195472,1
12,19,3,1.5,10.0,8.5,2023-12-27 14:00:33.959764,1
13,20,1,0.5,10.0,9.5,2023-12-27 14:10:57.546924,1
14,21,15,10.5,15.0,4.5,2023-12-27 15:59:08.924659,1
15,22,42,66.0,70.0,4.0,2023-12-27 16:47:31.721877,1
16,23,1,0.5,1.0,0.5,2023-12-27 16:57:06.429409,1
17,24,3,1.5,5.0,3.5,2023-12-27 16:59:18.575435,1

In [7]:
VENTAS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_venta        18 non-null     int64
 1   num_productos   18 non-null     int64
 2   total           18 non-null     float64
 3   valor_pagado    18 non-null     float64
 4   cambio          18 non-null     float64
 5   fecha_creacion  18 non-null     datetime64[ns]
 6   id_usuario_fk   18 non-null     int64
dtypes: datetime64[ns](1), float64(3), int64(3)
memory usage: 1.1 KB

In [13]:
current_year = VENTAS['fecha_creacion'].dt.year.max()
current_month = VENTAS['fecha_creacion'].dt.month.max()
current_month_data = VENTAS[(VENTAS['fecha_creacion'].dt.year == current_year) & (VENTAS['fecha_creacion'].dt.month == current_month)]
current_month_sales = current_month_data.groupby(current_month_data['fecha_creacion'].dt.date)['total'].sum().reset_index()

In [9]:
current_month_data

,id_venta,num_productos,total,valor_pagado,cambio,fecha_creacion,id_usuario_fk
0,1,3,6.0,10.0,4.0,2023-12-22 23:40:29.807236,1
1,2,3,6.0,10.0,4.0,2023-12-22 23:50:33.534514,1
2,3,3,6.0,10.0,4.0,2023-12-22 23:51:42.694241,1
3,4,1,7.5,10.0,2.5,2023-12-22 23:52:49.640618,1
4,5,2,4.0,5.0,1.0,2023-12-22 23:54:17.137453,1
5,6,1,2.0,5.0,3.0,2023-12-22 23:55:10.123227,1
6,7,1,2.0,5.0,3.0,2023-12-22 23:58:41.016204,1
7,8,2,4.0,5.0,1.0,2023-12-22 23:59:32.086504,1
8,9,1,2.0,2.0,0.0,2023-12-23 00:00:47.269447,1
9,10,1,2.0,2.0,0.0,2023-12-23 00:01:59.489409,1
10,11,1,2.0,2.0,0.0,2023-12-23 00:02:16.360055,1
11,12,4,8.0,10.0,2.0,2023-12-23 00:03:51.195472,1
12,19,3,1.5,10.0,8.5,2023-12-27 14:00:33.959764,1
13,20,1,0.5,10.0,9.5,2023-12-27 14:10:57.546924,1
14,21,15,10.5,15.0,4.5,2023-12-27 15:59:08.924659,1
15,22,42,66.0,70.0,4.0,2023-12-27 16:47:31.721877,1
16,23,1,0.5,1.0,0.5,2023-12-27 16:57:06.429409,1
17,24,3,1.5,5.0,3.5,2023-12-27 16:59:18.575435,1

In [19]:
current_month_data.groupby(current_month_data['fecha_creacion'].dt.year)['total'].sum().reset_index()

   fecha_creacion  total
0            2023  132.0

In [14]:
current_month_sales

  fecha_creacion  total
0     2023-12-22   37.5
1     2023-12-23   14.0
2     2023-12-27   80.5

In [24]:
dates_list = [date.strftime("%d-%m-%Y") for date in current_month_sales['fecha_creacion'].to_list()]
dates_list

['22-12-2023', '23-12-2023', '27-12-2023']

In [26]:
sales = current_month_sales['total'].tolist()
sales

[37.5, 14.0, 80.5]

### DATA ANALYSIS GENERAL

In [27]:
with alchemyEngine.connect() as dbConnection:
  VENTAS_GENERAL = pd.read_sql(
    "SELECT * FROM ventas v left join usuarios u on u.id_usuario = v.id_usuario_fk ",
    dbConnection,
  )

In [29]:
VENTAS_GENERAL.head(2)

,id_venta,num_productos,total,valor_pagado,cambio,fecha_creacion,id_usuario_fk,id_usuario,username,name_user
0,1,3,6.0,10.0,4.0,2023-12-22 23:40:29.807236,1,1,ximena,Ximena García
1,2,3,6.0,10.0,4.0,2023-12-22 23:50:33.534514,1,1,ximena,Ximena García

In [35]:
monthly_user_sales = VENTAS_GENERAL.groupby([VENTAS_GENERAL['fecha_creacion'].dt.to_period('D'), 'name_user'])['total'].sum().reset_index()

monthly_user_sales

  fecha_creacion         name_user  total
0     2023-12-22     Ximena García  37.50
1     2023-12-23  Alexandra Sinche  69.35
2     2023-12-23     Ximena García  14.00
3     2023-12-27     Ximena García  87.50

In [36]:
monthly_user_sales['fecha_creacion'].tolist()

[Period('2023-12-22', 'D'),
 Period('2023-12-23', 'D'),
 Period('2023-12-23', 'D'),
 Period('2023-12-27', 'D')]

In [38]:
monthly_user_sales = VENTAS_GENERAL.groupby([VENTAS_GENERAL['fecha_creacion'].dt.to_period('M'), 'name_user'])['total'].sum().reset_index()
monthly_user_sales['fecha_creacion'] = monthly_user_sales['fecha_creacion'].dt.strftime("%m-%Y")
monthly_user_sales['fecha_creacion'].tolist()

['12-2023', '12-2023']

In [40]:
monthly_user_sales = VENTAS_GENERAL.groupby([VENTAS_GENERAL['fecha_creacion'].dt.to_period('M')])['total'].sum().reset_index()
monthly_user_sales

  fecha_creacion   total
0        2023-12  208.35